import numpy as np

a = np.floor(10 * np.random.random((2, 12)))

'''
[[ 5.  3.  5.  4.  5.  7.  4.  1.  0.  9.  4.  0.]
 [ 9.  8.  5.  2.  4.  5.  4.  3.  8.  0.  7.  1.]]
'''
print(a)

# 横方向分割，a为要分割的矩阵，3表示分割为3份，对应hstack方法。
# hstack：将下面的拿到后面  hsplit：将后面的拿到下面
'''
[array([[ 5.,  3.,  5.,  4.],
       [ 9.,  8.,  5.,  2.]]), array([[ 5.,  7.,  4.,  1.],
       [ 4.,  5.,  4.,  3.]]), array([[ 0.,  9.,  4.,  0.],
       [ 8.,  0.,  7.,  1.]])]
'''
print(np.hsplit(a, 3))

# 在第三列后面切一下，在第四列后面切一下，两刀分三块
'''
[array([[ 5.,  3.,  5.],
       [ 9.,  8.,  5.]]), array([[ 4.],
       [ 2.]]), array([[ 5.,  7.,  4.,  1.,  0.,  9.,  4.,  0.],
       [ 4.,  5.,  4.,  3.,  8.,  0.,  7.,  1.]])]
'''
print(np.hsplit(a, (3, 4)))
